Bài tập 1: Cho một bảng Employee (file employee_01.csv đính kèm) chứa thông tin tất cả employees và
manager của các employees này. Mỗi employee có một Id và thông tin manager Id của người quản lý
- Dùng pandas liệt kê ra các employees có salary cao hơn manager của mình.

In [2]:
import numpy as np
import pandas as pd

In [26]:
e_1 = pd.read_csv('employee_01.csv',header = None, names=['id', 'name', 'salary', 'manager_id'])
e_1

   id   name  salary manager_id
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000        NaN
3   4    Max   90000

In [28]:
e_1.at[3, 'manager_id']

' '

In [29]:
e_1.at[2, 'manager_id']

nan

LOẠI BỎ 2 GIÁ TRỊ TRÊN

In [31]:
e_1.fillna(0)

   id   name  salary manager_id
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000          0
3   4    Max   90000

ứng với employee là manager id nào và save riêng thành 1 cột riêng

In [32]:
e_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          4 non-null      int64
 1   name        4 non-null      object
 2   salary      4 non-null      int64
 3   manager_id  3 non-null      object
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [33]:
e_1['id']=e_1.id.astype(str)

In [35]:
e_1.merge(e_1, left_on='manager_id', right_on='id', how='inner', suffixes=('_employee', '_manager')) \
.query("salary_employee > salary_manager")

,id_employee,name_employee,salary_employee,manager_id_employee,id_manager,name_manager,salary_manager,manager_id_manager
0,1,Joe,70000,3,3,Sam,60000,NaN

In [36]:
x = []
li = e_1.manager_id.notnull()
for i in range(len(e1.index)):
    if li[i] == True: 
        if e1.Manager_ID[i] == ' ':
            pass        
        elif e1.Salary[i] > e1.Salary[int(e1.Manager_ID[i])-1]:
            x.append(e1.Name[i])
pd.DataFrame({'Employee': x})

  Employee
0      Joe

Bài tập 2: Cho bảng Employee (file employee_02.csv đính kèm file này) chưa thông tin tất cả employees.
    Dùng pandas viết truy vấn tìm ra các employees có mức lương cao nhất của mỗi phòng ban

In [42]:
e_2 = pd.read_csv('employee_02.csv', header=None, names=['id', 'name', 'salary', 'department_id'])
e_2

   id   name  salary  department_id
0   1    Joe   70000              1
1   2    Jim   90000              1
2   3  Henry   80000              2
3   4    Sam   60000              2
4   5    Max   90000              1

In [40]:
df = pd.read_csv('department.csv', header=None, names=['department_id', 'department_name'])
df

   department_id department_name
0              1              IT
1              2           Sales

In [48]:
result= e_2.merge(df, on='department_id', how='inner').groupby(['department_name', 'name']).salary.max().to_frame().reset_index()
result

  department_name   name  salary
0              IT    Jim   90000
1              IT    Joe   70000
2              IT    Max   90000
3           Sales  Henry   80000
4           Sales    Sam   60000

In [50]:
result.nlargest(3, 'salary', keep='all')

  department_name   name  salary
0              IT    Jim   90000
2              IT    Max   90000
3           Sales  Henry   80000